Revit 2023 API
AreaReinforcement.SetLayerActive Method
 Sets if the desired layer is active or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2022
Syntax
C#
public void SetLayerActive(
	bool active,
	AreaReinforcementLayerType layer
)
Visual Basic
Public Sub SetLayerActive ( _
	active As Boolean, _
	layer As AreaReinforcementLayerType _
)
Visual C++
public:
void SetLayerActive(
	bool active,
	AreaReinforcementLayerType layer
)
Parameters
active
Type: System.Boolean
 True to set the layer to be active, false otherwise.
layer
Type: Autodesk.Revit.DB.Structure.AreaReinforcementLayerType
 The layer type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace